; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-6-21)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-3 - location
	p1-2 - location
	p1-7 - location
	p2-6 - location
	p2-8 - location
	p2-9 - location
	p3-1 - location
	p3-9 - location
	p4-0 - location
	p6-4 - location
	p7-2 - location
	p7-6 - location
	p7-9 - location
	p8-3 - location
	p9-5 - location
	p9-6 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s0)
	(at driver3 s3)
	(at driver4 s4)
	(at driver5 s5)
	(at driver6 s3)
	(at driver7 s3)
	(at truck1 s7)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s7)
	(empty truck3)
	(at truck4 s6)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s5)
	(empty truck6)
	(at package1 s7)
	(at package2 s9)
	(at package3 s2)
	(at package4 s8)
	(at package5 s6)
	(at package6 s1)
	(at package7 s1)
	(at package8 s7)
	(at package9 s8)
	(at package10 s9)
	(at package11 s8)
	(at package12 s1)
	(at package13 s9)
	(at package14 s8)
	(at package15 s9)
	(at package16 s9)
	(at package17 s3)
	(at package18 s7)
	(at package19 s9)
	(at package20 s6)
	(at package21 s4)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(link s0 s5)
	(link s5 s0)
	(link s0 s7)
	(link s7 s0)
	(link s0 s8)
	(link s8 s0)
	(link s1 s5)
	(link s5 s1)
	(link s1 s6)
	(link s6 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s8)
	(link s8 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s1)
	(link s1 s3)
	(link s3 s7)
	(link s7 s3)
	(link s4 s3)
	(link s3 s4)
	(link s4 s5)
	(link s5 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s3)
	(link s3 s5)
	(link s5 s7)
	(link s7 s5)
	(link s6 s2)
	(link s2 s6)
	(link s6 s8)
	(link s8 s6)
	(link s7 s4)
	(link s4 s7)
	(link s9 s1)
	(link s1 s9)
	(link s9 s2)
	(link s2 s9)
	(link s9 s3)
	(link s3 s9)
	(link s9 s5)
	(link s5 s9)
)
	(:goal (and
	(at driver1 s6)
	(at driver2 s9)
	(at driver6 s0)
	(at driver7 s2)
	(at truck1 s8)
	(at truck3 s1)
	(at truck6 s9)
	(at package1 s3)
	(at package2 s9)
	(at package3 s3)
	(at package4 s7)
	(at package5 s4)
	(at package6 s9)
	(at package7 s6)
	(at package8 s3)
	(at package9 s4)
	(at package10 s0)
	(at package11 s7)
	(at package12 s7)
	(at package13 s9)
	(at package14 s8)
	(at package15 s5)
	(at package16 s6)
	(at package17 s7)
	(at package18 s5)
	(at package19 s3)
	(at package20 s3)
	(at package21 s1)
	))


)

; plan
1. (board-truck driver4 s4 truck2)
   deleted: (at driver4 s4) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 3 of 28
2. (drive-truck driver4 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 3 of 28
3. (load-truck s3 package17 truck2)
   deleted: (at package17 s3)
   added: (in package17 truck2)
   goals met: 3 of 28
4. (board-truck driver1 s5 truck6)
   deleted: (at driver1 s5) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 3 of 28
5. (drive-truck driver4 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 3 of 28
6. (drive-truck driver4 s1 s6 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   goals met: 3 of 28
7. (drive-truck driver4 s6 s8 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s8)
   goals met: 3 of 28
8. (load-truck s8 package9 truck2)
   deleted: (at package9 s8)
   added: (in package9 truck2)
   goals met: 3 of 28
9. (drive-truck driver4 s8 s6 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s6)
   goals met: 3 of 28
10. (load-truck s6 package5 truck2)
   deleted: (at package5 s6)
   added: (in package5 truck2)
   goals met: 3 of 28
11. (load-truck s6 package20 truck2)
   deleted: (at package20 s6)
   added: (in package20 truck2)
   goals met: 3 of 28
12. (drive-truck driver4 s6 s4 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   goals met: 3 of 28
13. (drive-truck driver4 s4 s7 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s7)
   goals met: 3 of 28
14. (load-truck s7 package8 truck2)
   deleted: (at package8 s7)
   added: (in package8 truck2)
   goals met: 3 of 28
15. (load-truck s7 package18 truck2)
   deleted: (at package18 s7)
   added: (in package18 truck2)
   goals met: 3 of 28
16. (unload-truck s7 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s7)
   goals met: 4 of 28
17. (load-truck s7 package1 truck2)
   deleted: (at package1 s7)
   added: (in package1 truck2)
   goals met: 4 of 28
18. (drive-truck driver4 s7 s3 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s3)
   goals met: 4 of 28
19. (unload-truck s3 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s3)
   goals met: 5 of 28
20. (drive-truck driver4 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 5 of 28
21. (unload-truck s4 package9 truck2)
   deleted: (in package9 truck2)
   added: (at package9 s4)
   goals met: 6 of 28
22. (unload-truck s4 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s4)
   goals met: 7 of 28
23. (drive-truck driver4 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 7 of 28
24. (drive-truck driver4 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 7 of 28
25. (drive-truck driver4 s1 s9 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s9)
   goals met: 7 of 28
26. (load-truck s9 package19 truck2)
   deleted: (at package19 s9)
   added: (in package19 truck2)
   goals met: 7 of 28
27. (load-truck s9 package16 truck2)
   deleted: (at package16 s9)
   added: (in package16 truck2)
   goals met: 7 of 28
28. (drive-truck driver4 s9 s1 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s1)
   goals met: 7 of 28
29. (load-truck s1 package7 truck2)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   goals met: 7 of 28
30. (load-truck s1 package6 truck2)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   goals met: 7 of 28
31. (load-truck s1 package12 truck2)
   deleted: (at package12 s1)
   added: (in package12 truck2)
   goals met: 7 of 28
32. (drive-truck driver4 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 7 of 28
33. (unload-truck s3 package20 truck2)
   deleted: (in package20 truck2)
   added: (at package20 s3)
   goals met: 8 of 28
34. (drive-truck driver4 s3 s9 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s9)
   goals met: 8 of 28
35. (unload-truck s9 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s9)
   goals met: 9 of 28
36. (load-truck s9 package15 truck2)
   deleted: (at package15 s9)
   added: (in package15 truck2)
   goals met: 9 of 28
37. (drive-truck driver4 s9 s3 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s3)
   goals met: 9 of 28
38. (drive-truck driver4 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 9 of 28
39. (load-truck s4 package21 truck2)
   deleted: (at package21 s4)
   added: (in package21 truck2)
   goals met: 9 of 28
40. (drive-truck driver4 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 9 of 28
41. (drive-truck driver4 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 9 of 28
42. (unload-truck s1 package21 truck2)
   deleted: (in package21 truck2)
   added: (at package21 s1)
   goals met: 10 of 28
43. (drive-truck driver1 s5 s0 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s0)
   goals met: 10 of 28
44. (drive-truck driver1 s0 s8 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s8)
   goals met: 10 of 28
45. (drive-truck driver4 s1 s3 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   goals met: 10 of 28
46. (unload-truck s3 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s3)
   goals met: 11 of 28
47. (drive-truck driver4 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 11 of 28
48. (unload-truck s5 package18 truck2)
   deleted: (in package18 truck2)
   added: (at package18 s5)
   goals met: 12 of 28
49. (drive-truck driver4 s5 s7 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s7)
   goals met: 12 of 28
50. (unload-truck s7 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s7)
   goals met: 13 of 28
51. (drive-truck driver1 s8 s2 truck6)
   deleted: (at truck6 s8)
   added: (at truck6 s2)
   goals met: 13 of 28
52. (load-truck s2 package3 truck6)
   deleted: (at package3 s2)
   added: (in package3 truck6)
   goals met: 13 of 28
53. (walk driver2 s0 p0-3)
   deleted: (at driver2 s0)
   added: (at driver2 p0-3)
   goals met: 13 of 28
54. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   goals met: 13 of 28
55. (walk driver2 s3 p3-9)
   deleted: (at driver2 s3)
   added: (at driver2 p3-9)
   goals met: 13 of 28
56. (walk driver2 p3-9 s9)
   deleted: (at driver2 p3-9)
   added: (at driver2 s9)
   goals met: 14 of 28
57. (walk driver6 s3 p0-3)
   deleted: (at driver6 s3)
   added: (at driver6 p0-3)
   goals met: 14 of 28
58. (walk driver6 p0-3 s0)
   deleted: (at driver6 p0-3)
   added: (at driver6 s0)
   goals met: 15 of 28
59. (walk driver7 s3 p8-3)
   deleted: (at driver7 s3)
   added: (at driver7 p8-3)
   goals met: 15 of 28
60. (walk driver7 p8-3 s8)
   deleted: (at driver7 p8-3)
   added: (at driver7 s8)
   goals met: 15 of 28
61. (walk driver7 s8 p2-8)
   deleted: (at driver7 s8)
   added: (at driver7 p2-8)
   goals met: 15 of 28
62. (walk driver7 p2-8 s2)
   deleted: (at driver7 p2-8)
   added: (at driver7 s2)
   goals met: 16 of 28
63. (drive-truck driver4 s7 s4 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s4)
   goals met: 16 of 28
64. (walk driver7 s2 p7-2)
   deleted: (at driver7 s2)
   added: (at driver7 p7-2)
   goals met: 15 of 28
65. (walk driver7 p7-2 s7)
   deleted: (at driver7 p7-2)
   added: (at driver7 s7)
   goals met: 15 of 28
66. (drive-truck driver4 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 15 of 28
67. (unload-truck s6 package7 truck2)
   deleted: (in package7 truck2)
   added: (at package7 s6)
   goals met: 16 of 28
68. (drive-truck driver4 s6 s4 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   goals met: 16 of 28
69. (drive-truck driver4 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 16 of 28
70. (unload-truck s3 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   goals met: 17 of 28
71. (drive-truck driver4 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 17 of 28
72. (drive-truck driver4 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 17 of 28
73. (unload-truck s5 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s5)
   goals met: 18 of 28
74. (drive-truck driver4 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 18 of 28
75. (drive-truck driver4 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 18 of 28
76. (drive-truck driver4 s6 s8 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s8)
   goals met: 18 of 28
77. (load-truck s8 package4 truck2)
   deleted: (at package4 s8)
   added: (in package4 truck2)
   goals met: 18 of 28
78. (load-truck s8 package11 truck2)
   deleted: (at package11 s8)
   added: (in package11 truck2)
   goals met: 18 of 28
79. (drive-truck driver4 s8 s0 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   goals met: 18 of 28
80. (drive-truck driver4 s0 s7 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s7)
   goals met: 18 of 28
81. (unload-truck s7 package4 truck2)
   deleted: (in package4 truck2)
   added: (at package4 s7)
   goals met: 19 of 28
82. (unload-truck s7 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s7)
   goals met: 20 of 28
83. (drive-truck driver4 s7 s4 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s4)
   goals met: 20 of 28
84. (drive-truck driver4 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 20 of 28
85. (unload-truck s6 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s6)
   goals met: 21 of 28
86. (drive-truck driver1 s2 s9 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s9)
   goals met: 22 of 28
87. (load-truck s9 package10 truck6)
   deleted: (at package10 s9)
   added: (in package10 truck6)
   goals met: 22 of 28
88. (drive-truck driver1 s9 s3 truck6)
   deleted: (at truck6 s9)
   added: (at truck6 s3)
   goals met: 21 of 28
89. (unload-truck s3 package3 truck6)
   deleted: (in package3 truck6)
   added: (at package3 s3)
   goals met: 22 of 28
90. (drive-truck driver1 s3 s0 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s0)
   goals met: 22 of 28
91. (unload-truck s0 package10 truck6)
   deleted: (in package10 truck6)
   added: (at package10 s0)
   goals met: 23 of 28
92. (drive-truck driver1 s0 s5 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s5)
   goals met: 23 of 28
93. (drive-truck driver1 s5 s9 truck6)
   deleted: (at truck6 s5)
   added: (at truck6 s9)
   goals met: 24 of 28
94. (board-truck driver7 s7 truck3)
   deleted: (at driver7 s7) (empty truck3)
   added: (driving driver7 truck3)
   goals met: 24 of 28
95. (drive-truck driver7 s7 s5 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   goals met: 24 of 28
96. (drive-truck driver7 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 25 of 28
97. (drive-truck driver7 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 24 of 28
98. (walk driver2 s9 p7-9)
   deleted: (at driver2 s9)
   added: (at driver2 p7-9)
   goals met: 23 of 28
99. (disembark-truck driver7 s2 truck3)
   deleted: (driving driver7 truck3)
   added: (at driver7 s2) (empty truck3)
   goals met: 24 of 28
100. (walk driver2 p7-9 s7)
   deleted: (at driver2 p7-9)
   added: (at driver2 s7)
   goals met: 24 of 28
101. (drive-truck driver1 s9 s2 truck6)
   deleted: (at truck6 s9)
   added: (at truck6 s2)
   goals met: 23 of 28
102. (walk driver2 s7 p7-9)
   deleted: (at driver2 s7)
   added: (at driver2 p7-9)
   goals met: 23 of 28
103. (walk driver2 p7-9 s9)
   deleted: (at driver2 p7-9)
   added: (at driver2 s9)
   goals met: 24 of 28
104. (walk driver7 s2 p7-2)
   deleted: (at driver7 s2)
   added: (at driver7 p7-2)
   goals met: 23 of 28
105. (walk driver7 p7-2 s7)
   deleted: (at driver7 p7-2)
   added: (at driver7 s7)
   goals met: 23 of 28
106. (disembark-truck driver1 s2 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s2) (empty truck6)
   goals met: 23 of 28
107. (walk driver7 s7 p7-2)
   deleted: (at driver7 s7)
   added: (at driver7 p7-2)
   goals met: 23 of 28
108. (walk driver7 p7-2 s2)
   deleted: (at driver7 p7-2)
   added: (at driver7 s2)
   goals met: 24 of 28
109. (walk driver1 s2 p2-6)
   deleted: (at driver1 s2)
   added: (at driver1 p2-6)
   goals met: 24 of 28
110. (walk driver1 p2-6 s6)
   deleted: (at driver1 p2-6)
   added: (at driver1 s6)
   goals met: 25 of 28
111. (board-truck driver7 s2 truck6)
   deleted: (at driver7 s2) (empty truck6)
   added: (driving driver7 truck6)
   goals met: 24 of 28
112. (drive-truck driver7 s2 s9 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s9)
   goals met: 25 of 28
113. (walk driver2 s9 p2-9)
   deleted: (at driver2 s9)
   added: (at driver2 p2-9)
   goals met: 24 of 28
114. (walk driver2 p2-9 s2)
   deleted: (at driver2 p2-9)
   added: (at driver2 s2)
   goals met: 24 of 28
115. (board-truck driver2 s2 truck3)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 24 of 28
116. (drive-truck driver2 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 25 of 28
117. (drive-truck driver2 s1 s9 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s9)
   goals met: 24 of 28
118. (disembark-truck driver2 s9 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s9) (empty truck3)
   goals met: 25 of 28
119. (walk driver2 s9 p7-9)
   deleted: (at driver2 s9)
   added: (at driver2 p7-9)
   goals met: 24 of 28
120. (walk driver2 p7-9 s7)
   deleted: (at driver2 p7-9)
   added: (at driver2 s7)
   goals met: 24 of 28
121. (board-truck driver2 s7 truck1)
   deleted: (at driver2 s7) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 24 of 28
122. (drive-truck driver7 s9 s2 truck6)
   deleted: (at truck6 s9)
   added: (at truck6 s2)
   goals met: 23 of 28
123. (walk driver5 s5 p9-5)
   deleted: (at driver5 s5)
   added: (at driver5 p9-5)
   goals met: 23 of 28
124. (walk driver5 p9-5 s9)
   deleted: (at driver5 p9-5)
   added: (at driver5 s9)
   goals met: 23 of 28
125. (disembark-truck driver2 s7 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s7) (empty truck1)
   goals met: 23 of 28
126. (disembark-truck driver7 s2 truck6)
   deleted: (driving driver7 truck6)
   added: (at driver7 s2) (empty truck6)
   goals met: 24 of 28
127. (walk driver2 s7 p7-9)
   deleted: (at driver2 s7)
   added: (at driver2 p7-9)
   goals met: 24 of 28
128. (walk driver2 p7-9 s9)
   deleted: (at driver2 p7-9)
   added: (at driver2 s9)
   goals met: 25 of 28
129. (walk driver7 s2 p7-2)
   deleted: (at driver7 s2)
   added: (at driver7 p7-2)
   goals met: 24 of 28
130. (walk driver7 p7-2 s7)
   deleted: (at driver7 p7-2)
   added: (at driver7 s7)
   goals met: 24 of 28
131. (board-truck driver2 s9 truck3)
   deleted: (at driver2 s9) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 23 of 28
132. (drive-truck driver2 s9 s2 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s2)
   goals met: 23 of 28
133. (disembark-truck driver2 s2 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 23 of 28
134. (board-truck driver2 s2 truck6)
   deleted: (at driver2 s2) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 23 of 28
135. (drive-truck driver2 s2 s9 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s9)
   goals met: 24 of 28
136. (drive-truck driver4 s6 s2 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   goals met: 24 of 28
137. (disembark-truck driver4 s2 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s2) (empty truck2)
   goals met: 24 of 28
138. (board-truck driver4 s2 truck3)
   deleted: (at driver4 s2) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 24 of 28
139. (drive-truck driver4 s2 s1 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   goals met: 25 of 28
140. (disembark-truck driver2 s9 truck6)
   deleted: (driving driver2 truck6)
   added: (at driver2 s9) (empty truck6)
   goals met: 26 of 28
141. (walk driver7 s7 p7-2)
   deleted: (at driver7 s7)
   added: (at driver7 p7-2)
   goals met: 26 of 28
142. (walk driver7 p7-2 s2)
   deleted: (at driver7 p7-2)
   added: (at driver7 s2)
   goals met: 27 of 28
143. (walk driver5 s9 p7-9)
   deleted: (at driver5 s9)
   added: (at driver5 p7-9)
   goals met: 27 of 28
144. (walk driver5 p7-9 s7)
   deleted: (at driver5 p7-9)
   added: (at driver5 s7)
   goals met: 27 of 28
145. (board-truck driver5 s7 truck1)
   deleted: (at driver5 s7) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 27 of 28
146. (drive-truck driver5 s7 s0 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   goals met: 27 of 28
147. (drive-truck driver5 s0 s8 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s8)
   goals met: 28 of 28
